import * as React from "react"
import { Link } from "gatsby"

import Layout from "../components/layout"
import Seo from "../components/seo"

const About = () => {
  return (
    <Layout>
      <div className="w-screen overflow-auto object-cover bg-lime-200 text-amber-500 bg-[url('../images/bg_1_3.png')]">
        <div className="w-full max-w-sm  md:max-w-3xl xl:max-w-5xl 2xl:max-w-screen-2xl mx-auto p-6 md:p-10 xl:p-12">
          <h1>Про мій сайт :)</h1>
          <p>Тут буде опис та мета сайту</p>
          <p>
            На сайті завжди є зображення, вони допомагають донести смислове
            значення або просто додати декоративне оформлення сторінки. Отже,
            існує два типи зображень: контентні та декоративні. Яка між ними
            різниця? Контентні зображення - несуть смислове навантаження,
            належать до змісту сторінки і допомагають донести до користувача
            корисну для нього інформацію. Вони додаються в HTML-розмітці за
            допомогою тегу з обов'язково заповненим атрибутом alt, що описує
            зображення. Фотографія продукту на картці товару в
            інтернет-магазині, фотографії членів команди, логотип компанії,
            рекламні банери, карти з локацією, зображення слайдера, аватарки -
            це все контентні зображення. Декоративні зображення -
            використовуються виключно для додаткового оформлення. Вони не несуть
            жодної корисної інформації і слугують виключно для «краси».
            Додаються через CSS як фон, використовуючи властивість
            background-image, або розмічаються в HTML тегом (у разі векторної
            графіки). Кастомні маркери списків, усілякі допоміжні іконки,
            плашки, фонові зображення блоків - це все декоративні зображення.
            Кілька особливостей такого поділу. Очищається код сторінки, що
            покращує його читабельність для розробника, спрощує роботу пошукових
            роботів і прискорює початкове завантаження сторінки. Все, що повинно
            бути проіндексовано роботами, додаємо як , інше - фоном. Під час
            друку веб-сторінки теги друкуються, а фонові зображення не
            друкуються. Асистивні технології (скрінрідери) для людей з
            обмеженими можливостями читають alt зображень, тому, якщо зображення
            несе інформацію, воно обов'язково повинно бути в HTML-розмітці.
          </p>
          <Link to="/">Go back to the homepage</Link>
        </div>
      </div>
    </Layout>
  )
}

export const Head = () => <Seo title="About" />

export default About
